electro-smith/libDaisy/core/startup_stm32h750xx.c
void __attribute__ ((weak)) OTG_HS_WKUP_IRQHandler() 
{
	//If you hit the breakpoint below, one of the interrupts was unhandled in your code. 
	//Define the following function in your code to handle it:
	//	extern "C" void OTG_HS_WKUP_IRQHandler();
	asm("bkpt 255");
}

void __attribute__ ((weak)) OTG_HS_IRQHandler() 
{
	//If you hit the breakpoint below, one of the interrupts was unhandled in your code. 
	//Define the following function in your code to handle it:
	//	extern "C" void OTG_HS_IRQHandler();
	asm("bkpt 255");
}

void __attribute__ ((weak)) DCMI_IRQHandler() 
{
	//If you hit the breakpoint below, one of the interrupts was unhandled in your code. 
	//Define the following function in your code to handle it:
	//	extern "C" void DCMI_IRQHandler();
	asm("bkpt 255");
}

void __attribute__ ((weak)) CRYP_IRQHandler() 
{
	//If you hit the breakpoint below, one of the interrupts was unhandled in your code. 
	//Define the following function in your code to handle it:
	//	extern "C" void CRYP_IRQHandler();
	asm("bkpt 255");
}

void __attribute__ ((weak)) HASH_RNG_IRQHandler() 
{
	//If you hit the breakpoint below, one of the interrupts was unhandled in your code. 
	//Define the following function in your code to handle it:
	//	extern "C" void HASH_RNG_IRQHandler();
	asm("bkpt 255");
}

void __attribute__ ((weak)) FPU_IRQHandler() 
{
	//If you hit the breakpoint below, one of the interrupts was unhandled in your code. 
	//Define the following function in your code to handle it:
	//	extern "C" void FPU_IRQHandler();
	asm("bkpt 255");
}

void __attribute__ ((weak)) UART7_IRQHandler() 
{
	//If you hit the breakpoint below, one of the interrupts was unhandled in your code. 
	//Define the following function in your code to handle it:
	//	extern "C" void UART7_IRQHandler();
	asm("bkpt 255");
}

void __attribute__ ((weak)) UART8_IRQHandler() 
{
	//If you hit the breakpoint below, one of the interrupts was unhandled in your code. 
	//Define the following function in your code to handle it:
	//	extern "C" void UART8_IRQHandler();
	asm("bkpt 255");
}

void __attribute__ ((weak)) SPI4_IRQHandler() 
{
	//If you hit the breakpoint below, one of the interrupts was unhandled in your code. 
	//Define the following function in your code to handle it:
	//	extern "C" void SPI4_IRQHandler();
	asm("bkpt 255");
}

void __attribute__ ((weak)) SPI5_IRQHandler() 
{
	//If you hit the breakpoint below, one of the interrupts was unhandled in your code. 
	//Define the following function in your code to handle it:
	//	extern "C" void SPI5_IRQHandler();
	asm("bkpt 255");
}

void __attribute__ ((weak)) SPI6_IRQHandler() 
{
	//If you hit the breakpoint below, one of the interrupts was unhandled in your code. 
	//Define the following function in your code to handle it:
	//	extern "C" void SPI6_IRQHandler();
	asm("bkpt 255");
}

void __attribute__ ((weak)) SAI1_IRQHandler() 
{
	//If you hit the breakpoint below, one of the interrupts was unhandled in your code. 
	//Define the following function in your code to handle it:
	//	extern "C" void SAI1_IRQHandler();
	asm("bkpt 255");
}

void __attribute__ ((weak)) LTDC_IRQHandler() 
{
	//If you hit the breakpoint below, one of the interrupts was unhandled in your code. 
	//Define the following function in your code to handle it:
	//	extern "C" void LTDC_IRQHandler();
	asm("bkpt 255");
}

void __attribute__ ((weak)) LTDC_ER_IRQHandler() 
{
	//If you hit the breakpoint below, one of the interrupts was unhandled in your code. 
	//Define the following function in your code to handle it:
	//	extern "C" void LTDC_ER_IRQHandler();
	asm("bkpt 255");
}

void __attribute__ ((weak)) DMA2D_IRQHandler() 
{
	//If you hit the breakpoint below, one of the interrupts was unhandled in your code. 
	//Define the following function in your code to handle it:
	//	extern "C" void DMA2D_IRQHandler();
	asm("bkpt 255");
}

void __attribute__ ((weak)) SAI2_IRQHandler() 
{
	//If you hit the breakpoint below, one of the interrupts was unhandled in your code. 
	//Define the following function in your code to handle it:
	//	extern "C" void SAI2_IRQHandler();
	asm("bkpt 255");
}

void __attribute__ ((weak)) QUADSPI_IRQHandler() 
{
	//If you hit the breakpoint below, one of the interrupts was unhandled in your code. 
	//Define the following function in your code to handle it:
	//	extern "C" void QUADSPI_IRQHandler();
	asm("bkpt 255");
}

void __attribute__ ((weak)) LPTIM1_IRQHandler() 
{
	//If you hit the breakpoint below, one of the interrupts was unhandled in your code. 
	//Define the following function in your code to handle it:
	//	extern "C" void LPTIM1_IRQHandler();
	asm("bkpt 255");
}

void __attribute__ ((weak)) CEC_IRQHandler() 
{
	//If you hit the breakpoint below, one of the interrupts was unhandled in your code. 
	//Define the following function in your code to handle it:
	//	extern "C" void CEC_IRQHandler();
	asm("bkpt 255");
}

void __attribute__ ((weak)) I2C4_EV_IRQHandler() 
{
	//If you hit the breakpoint below, one of the interrupts was unhandled in your code. 
	//Define the following function in your code to handle it:
	//	extern "C" void I2C4_EV_IRQHandler();
	asm("bkpt 255");
}

void __attribute__ ((weak)) I2C4_ER_IRQHandler() 
{
	//If you hit the breakpoint below, one of the interrupts was unhandled in your code. 
	//Define the following function in your code to handle it:
	//	extern "C" void I2C4_ER_IRQHandler();
	asm("bkpt 255");
}

void __attribute__ ((weak)) SPDIF_RX_IRQHandler() 
{
	//If you hit the breakpoint below, one of the interrupts was unhandled in your code. 
	//Define the following function in your code to handle it:
	//	extern "C" void SPDIF_RX_IRQHandler();
	asm("bkpt 255");
}

void __attribute__ ((weak)) OTG_FS_EP1_OUT_IRQHandler() 
{
	//If you hit the breakpoint below, one of the interrupts was unhandled in your code. 
	//Define the following function in your code to handle it:
	//	extern "C" void OTG_FS_EP1_OUT_IRQHandler();
	asm("bkpt 255");
}

void __attribute__ ((weak)) OTG_FS_EP1_IN_IRQHandler() 
{
	//If you hit the breakpoint below, one of the interrupts was unhandled in your code. 
	//Define the following function in your code to handle it:
	//	extern "C" void OTG_FS_EP1_IN_IRQHandler();
	asm("bkpt 255");
}

void __attribute__ ((weak)) OTG_FS_WKUP_IRQHandler() 
{
	//If you hit the breakpoint below, one of the interrupts was unhandled in your code. 
	//Define the following function in your code to handle it:
	//	extern "C" void OTG_FS_WKUP_IRQHandler();
	asm("bkpt 255");
}

void __attribute__ ((weak)) OTG_FS_IRQHandler() 
{
	//If you hit the breakpoint below, one of the interrupts was unhandled in your code. 
	//Define the following function in your code to handle it:
	//	extern "C" void OTG_FS_IRQHandler();
	asm("bkpt 255");
}

void __attribute__ ((weak)) DMAMUX1_OVR_IRQHandler() 
{
	//If you hit the breakpoint below, one of the interrupts was unhandled in your code. 
	//Define the following function in your code to handle it:
	//	extern "C" void DMAMUX1_OVR_IRQHandler();
	asm("bkpt 255");
}

void __attribute__ ((weak)) HRTIM1_Master_IRQHandler() 
{
	//If you hit the breakpoint below, one of the interrupts was unhandled in your code. 
	//Define the following function in your code to handle it:
	//	extern "C" void HRTIM1_Master_IRQHandler();
	asm("bkpt 255");
}

void __attribute__ ((weak)) HRTIM1_TIMA_IRQHandler() 
{
	//If you hit the breakpoint below, one of the interrupts was unhandled in your code. 
	//Define the following function in your code to handle it:
	//	extern "C" void HRTIM1_TIMA_IRQHandler();
	asm("bkpt 255");
}

void __attribute__ ((weak)) HRTIM1_TIMB_IRQHandler() 
{
	//If you hit the breakpoint below, one of the interrupts was unhandled in your code. 
	//Define the following function in your code to handle it:
	//	extern "C" void HRTIM1_TIMB_IRQHandler();
	asm("bkpt 255");
}

