electro-smith/libDaisy/core/startup_stm32h750xx.c
void __attribute__ ((weak)) HRTIM1_TIMC_IRQHandler() 
{
	//If you hit the breakpoint below, one of the interrupts was unhandled in your code. 
	//Define the following function in your code to handle it:
	//	extern "C" void HRTIM1_TIMC_IRQHandler();
	asm("bkpt 255");
}

void __attribute__ ((weak)) HRTIM1_TIMD_IRQHandler() 
{
	//If you hit the breakpoint below, one of the interrupts was unhandled in your code. 
	//Define the following function in your code to handle it:
	//	extern "C" void HRTIM1_TIMD_IRQHandler();
	asm("bkpt 255");
}

void __attribute__ ((weak)) HRTIM1_TIME_IRQHandler() 
{
	//If you hit the breakpoint below, one of the interrupts was unhandled in your code. 
	//Define the following function in your code to handle it:
	//	extern "C" void HRTIM1_TIME_IRQHandler();
	asm("bkpt 255");
}

void __attribute__ ((weak)) HRTIM1_FLT_IRQHandler() 
{
	//If you hit the breakpoint below, one of the interrupts was unhandled in your code. 
	//Define the following function in your code to handle it:
	//	extern "C" void HRTIM1_FLT_IRQHandler();
	asm("bkpt 255");
}

void __attribute__ ((weak)) DFSDM1_FLT0_IRQHandler() 
{
	//If you hit the breakpoint below, one of the interrupts was unhandled in your code. 
	//Define the following function in your code to handle it:
	//	extern "C" void DFSDM1_FLT0_IRQHandler();
	asm("bkpt 255");
}

void __attribute__ ((weak)) DFSDM1_FLT1_IRQHandler() 
{
	//If you hit the breakpoint below, one of the interrupts was unhandled in your code. 
	//Define the following function in your code to handle it:
	//	extern "C" void DFSDM1_FLT1_IRQHandler();
	asm("bkpt 255");
}

void __attribute__ ((weak)) DFSDM1_FLT2_IRQHandler() 
{
	//If you hit the breakpoint below, one of the interrupts was unhandled in your code. 
	//Define the following function in your code to handle it:
	//	extern "C" void DFSDM1_FLT2_IRQHandler();
	asm("bkpt 255");
}

void __attribute__ ((weak)) DFSDM1_FLT3_IRQHandler() 
{
	//If you hit the breakpoint below, one of the interrupts was unhandled in your code. 
	//Define the following function in your code to handle it:
	//	extern "C" void DFSDM1_FLT3_IRQHandler();
	asm("bkpt 255");
}

void __attribute__ ((weak)) SAI3_IRQHandler() 
{
	//If you hit the breakpoint below, one of the interrupts was unhandled in your code. 
	//Define the following function in your code to handle it:
	//	extern "C" void SAI3_IRQHandler();
	asm("bkpt 255");
}

void __attribute__ ((weak)) SWPMI1_IRQHandler() 
{
	//If you hit the breakpoint below, one of the interrupts was unhandled in your code. 
	//Define the following function in your code to handle it:
	//	extern "C" void SWPMI1_IRQHandler();
	asm("bkpt 255");
}

void __attribute__ ((weak)) TIM15_IRQHandler() 
{
	//If you hit the breakpoint below, one of the interrupts was unhandled in your code. 
	//Define the following function in your code to handle it:
	//	extern "C" void TIM15_IRQHandler();
	asm("bkpt 255");
}

void __attribute__ ((weak)) TIM16_IRQHandler() 
{
	//If you hit the breakpoint below, one of the interrupts was unhandled in your code. 
	//Define the following function in your code to handle it:
	//	extern "C" void TIM16_IRQHandler();
	asm("bkpt 255");
}

void __attribute__ ((weak)) TIM17_IRQHandler() 
{
	//If you hit the breakpoint below, one of the interrupts was unhandled in your code. 
	//Define the following function in your code to handle it:
	//	extern "C" void TIM17_IRQHandler();
	asm("bkpt 255");
}

void __attribute__ ((weak)) MDIOS_WKUP_IRQHandler() 
{
	//If you hit the breakpoint below, one of the interrupts was unhandled in your code. 
	//Define the following function in your code to handle it:
	//	extern "C" void MDIOS_WKUP_IRQHandler();
	asm("bkpt 255");
}

void __attribute__ ((weak)) MDIOS_IRQHandler() 
{
	//If you hit the breakpoint below, one of the interrupts was unhandled in your code. 
	//Define the following function in your code to handle it:
	//	extern "C" void MDIOS_IRQHandler();
	asm("bkpt 255");
}

void __attribute__ ((weak)) JPEG_IRQHandler() 
{
	//If you hit the breakpoint below, one of the interrupts was unhandled in your code. 
	//Define the following function in your code to handle it:
	//	extern "C" void JPEG_IRQHandler();
	asm("bkpt 255");
}

void __attribute__ ((weak)) MDMA_IRQHandler() 
{
	//If you hit the breakpoint below, one of the interrupts was unhandled in your code. 
	//Define the following function in your code to handle it:
	//	extern "C" void MDMA_IRQHandler();
	asm("bkpt 255");
}

void __attribute__ ((weak)) SDMMC2_IRQHandler() 
{
	//If you hit the breakpoint below, one of the interrupts was unhandled in your code. 
	//Define the following function in your code to handle it:
	//	extern "C" void SDMMC2_IRQHandler();
	asm("bkpt 255");
}

void __attribute__ ((weak)) HSEM1_IRQHandler() 
{
	//If you hit the breakpoint below, one of the interrupts was unhandled in your code. 
	//Define the following function in your code to handle it:
	//	extern "C" void HSEM1_IRQHandler();
	asm("bkpt 255");
}

void __attribute__ ((weak)) ADC3_IRQHandler() 
{
	//If you hit the breakpoint below, one of the interrupts was unhandled in your code. 
	//Define the following function in your code to handle it:
	//	extern "C" void ADC3_IRQHandler();
	asm("bkpt 255");
}

void __attribute__ ((weak)) DMAMUX2_OVR_IRQHandler() 
{
	//If you hit the breakpoint below, one of the interrupts was unhandled in your code. 
	//Define the following function in your code to handle it:
	//	extern "C" void DMAMUX2_OVR_IRQHandler();
	asm("bkpt 255");
}

void __attribute__ ((weak)) BDMA_Channel0_IRQHandler() 
{
	//If you hit the breakpoint below, one of the interrupts was unhandled in your code. 
	//Define the following function in your code to handle it:
	//	extern "C" void BDMA_Channel0_IRQHandler();
	asm("bkpt 255");
}

void __attribute__ ((weak)) BDMA_Channel1_IRQHandler() 
{
	//If you hit the breakpoint below, one of the interrupts was unhandled in your code. 
	//Define the following function in your code to handle it:
	//	extern "C" void BDMA_Channel1_IRQHandler();
	asm("bkpt 255");
}

void __attribute__ ((weak)) BDMA_Channel2_IRQHandler() 
{
	//If you hit the breakpoint below, one of the interrupts was unhandled in your code. 
	//Define the following function in your code to handle it:
	//	extern "C" void BDMA_Channel2_IRQHandler();
	asm("bkpt 255");
}

